# Springboard Data Science Career Track Unit 4 Challenge - Tier 3 Complete

## Objectives
Hey! Great job getting through those challenging DataCamp courses. You're learning a lot in a short span of time. 

In this notebook, you're going to apply the skills you've been learning, bridging the gap between the controlled environment of DataCamp and the *slightly* messier work that data scientists do with actual datasets!

Here’s the mystery we’re going to solve: ***which boroughs of London have seen the greatest increase in housing prices, on average, over the last two decades?***


A borough is just a fancy word for district. You may be familiar with the five boroughs of New York… well, there are 32 boroughs within Greater London [(here's some info for the curious)](https://en.wikipedia.org/wiki/London_boroughs). Some of them are more desirable areas to live in, and the data will reflect that with a greater rise in housing prices.

***This is the Tier 3 notebook, which means it's not filled in at all: we'll just give you the skeleton of a project, the brief and the data. It's up to you to play around with it and see what you can find out! Good luck! If you struggle, feel free to look at easier tiers for help; but try to dip in and out of them, as the more independent work you do, the better it is for your learning!***

This challenge will make use of only what you learned in the following DataCamp courses: 
- Prework courses (Introduction to Python for Data Science, Intermediate Python for Data Science)
- Data Types for Data Science
- Python Data Science Toolbox (Part One) 
- pandas Foundations
- Manipulating DataFrames with pandas
- Merging DataFrames with pandas

Of the tools, techniques and concepts in the above DataCamp courses, this challenge should require the application of the following: 
- **pandas**
    - **data ingestion and inspection** (pandas Foundations, Module One) 
    - **exploratory data analysis** (pandas Foundations, Module Two)
    - **tidying and cleaning** (Manipulating DataFrames with pandas, Module Three) 
    - **transforming DataFrames** (Manipulating DataFrames with pandas, Module One)
    - **subsetting DataFrames with lists** (Manipulating DataFrames with pandas, Module One) 
    - **filtering DataFrames** (Manipulating DataFrames with pandas, Module One) 
    - **grouping data** (Manipulating DataFrames with pandas, Module Four) 
    - **melting data** (Manipulating DataFrames with pandas, Module Three) 
    - **advanced indexing** (Manipulating DataFrames with pandas, Module Four) 
- **matplotlib** (Intermediate Python for Data Science, Module One)
- **fundamental data types** (Data Types for Data Science, Module One) 
- **dictionaries** (Intermediate Python for Data Science, Module Two)
- **handling dates and times** (Data Types for Data Science, Module Four)
- **function definition** (Python Data Science Toolbox - Part One, Module One)
- **default arguments, variable length, and scope** (Python Data Science Toolbox - Part One, Module Two) 
- **lambda functions and error handling** (Python Data Science Toolbox - Part One, Module Four)

## The Data Science Pipeline

This is Tier Three, so we'll get you started. But after that, it's all in your hands! When you feel done with your investigations, look back over what you've accomplished, and prepare a quick presentation of your findings for the next mentor meeting. 

Data Science is magical. In this case study, you'll get to apply some complex machine learning algorithms. But as  [David Spiegelhalter](https://www.youtube.com/watch?v=oUs1uvsz0Ok) reminds us, there is no substitute for simply **taking a really, really good look at the data.** Sometimes, this is all we need to answer our question.

Data Science projects generally adhere to the four stages of Data Science Pipeline:
1. Sourcing and loading 
2. Cleaning, transforming, and visualizing 
3. Modeling 
4. Evaluating and concluding

### 1. Sourcing and Loading 

Any Data Science project kicks off by importing  ***pandas***. The documentation of this wonderful library can be found [here](https://pandas.pydata.org/). As you've seen, pandas is conveniently connected to the [Numpy](http://www.numpy.org/) and [Matplotlib](https://matplotlib.org/) libraries. 

***Hint:*** This part of the data science pipeline will test those skills you acquired in the pandas Foundations course, Module One.

#### 1.1. Importing Libraries

In [2]:
# Let's import the pandas, numpy libraries as pd, and np respectively. 
# Load the pyplot collection of functions from matplotlib, as plt 
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

#### 1.2.  Loading the data
Your data comes from the [London Datastore](https://data.london.gov.uk/): a free, open-source data-sharing portal for London-oriented datasets.

In [8]:
# First, make a variable called url_LondonHousePrices, and assign it the following link, enclosed in quotation-marks as a string:
# https://data.london.gov.uk/download/uk-house-price-index/70ac0766-8902-4eb5-aab5-01951aaed773/UK%20House%20price%20index.xls

houseprice = "https://data.london.gov.uk/download/uk-house-price-index/70ac0766-8902-4eb5-aab5-01951aaed773/UK%20House%20price%20index.xls"

# The dataset we're interested in contains the Average prices of the houses, and is actually on a particular sheet of the Excel file. 
# As a result, we need to specify the sheet name in the read_excel() method.
# Put this data into a variable called properties.

In [9]:
houseprice

'https://data.london.gov.uk/download/uk-house-price-index/70ac0766-8902-4eb5-aab5-01951aaed773/UK%20House%20price%20index.xls'

In [16]:
df_avg_price = pd.read_excel('https://data.london.gov.uk/download/uk-house-price-index/70ac0766-8902-4eb5-aab5-01951aaed773/UK%20House%20price%20index.xls', sheet_name='Average price', index_col= None)

In [23]:
df_avg_price

,Unnamed: 0,City of London,Barking & Dagenham,Barnet,Bexley,Brent,Bromley,Camden,Croydon,Ealing,...,NORTH WEST,YORKS & THE HUMBER,EAST MIDLANDS,WEST MIDLANDS,EAST OF ENGLAND,LONDON,SOUTH EAST,SOUTH WEST,Unnamed: 47,England
0,NaT,E09000001,E09000002,E09000003,E09000004,E09000005,E09000006,E09000007,E09000008,E09000009,...,E12000002,E12000003,E12000004,E12000005,E12000006,E12000007,E12000008,E12000009,NaN,E92000001
1,1995-01-01,91448.98487,50460.2266,93284.51832,64958.09036,71306.56698,81671.47692,120932.8881,69158.16225,79885.89069,...,43958.48001,44803.42878,45544.52227,48527.52339,56701.5961,74435.76052,64018.87894,54705.1579,NaN,53202.77128
2,1995-02-01,82202.77314,51085.77983,93190.16963,64787.92069,72022.26197,81657.55944,119508.8622,68951.09542,80897.06551,...,43925.42289,44528.80721,46051.57066,49341.29029,56593.59475,72777.93709,63715.02399,54356.14843,NaN,53096.1549
3,1995-03-01,79120.70256,51268.96956,92247.52435,64367.49344,72015.76274,81449.31143,120282.2131,68712.44341,81379.86288,...,44434.8681,45200.46775,45383.82395,49442.17973,56171.18278,73896.84204,64113.60858,53583.07667,NaN,53201.2843
4,1995-04-01,77101.20804,53133.50526,90762.87492,64277.66881,72965.63094,81124.41227,120097.899,68610.04641,82188.90498,...,44267.7796,45614.34341,46124.23045,49455.93299,56567.89582,74455.28754,64623.22395,54786.01938,NaN,53590.8548
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
332,2022-08-01,827996.60081,350239.35981,601931.6599,402667.50443,562407.51963,513498.76677,867930.22712,426105.46581,537220.87128,...,216321.72923,210137.55996,250337.29498,251926.80195,358295.87674,545608.08542,398893.43107,334116.32941,NaN,311435.11047
333,2022-09-01,827441.27622,349653.85502,605424.18481,403468.56545,584927.5386,515462.53348,857955.76149,432807.5594,540135.90519,...,218457.16,212196.46925,252252.9242,254389.50251,361500.40182,546005.12615,402606.92676,335743.93622,NaN,313884.51408
334,2022-10-01,870799.60044,355290.62346,597777.32861,409719.69933,578010.59307,522979.73425,841595.77335,434228.2722,541818.73318,...,220006.64656,212847.74493,252682.94085,256453.07431,362314.62574,539975.01492,403471.00209,337487.67124,NaN,314711.79602
335,2022-11-01,948073.2088,359495.10689,587967.70766,410407.63764,572262.24808,523810.59406,838162.23572,432216.9619,543594.15108,...,221431.98186,213389.07508,254952.86288,256139.51979,366771.68741,542910.65717,402652.10802,336748.30059,NaN,315695.90027
336,2022-12-01,968059.9863,362054.07567,595486.30411,416059.80994,566794.73925,523364.68872,842166.73612,430255.62154,548033.94229,...,221100.65258,214772.92559,256158.76167,256206.15838,363779.44643,543098.82276,404228.91584,330601.04469,NaN,315119.06969

In [19]:
df_avg_price.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 337 entries, 0 to 336
Data columns (total 49 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Unnamed: 0            336 non-null    datetime64[ns]
 1   City of London        337 non-null    object
 2   Barking & Dagenham    337 non-null    object
 3   Barnet                337 non-null    object
 4   Bexley                337 non-null    object
 5   Brent                 337 non-null    object
 6   Bromley               337 non-null    object
 7   Camden                337 non-null    object
 8   Croydon               337 non-null    object
 9   Ealing                337 non-null    object
 10  Enfield               337 non-null    object
 11  Greenwich             337 non-null    object
 12  Hackney               337 non-null    object
 13  Hammersmith & Fulham  337 non-null    object
 14  Haringey              337 non-null    object
 15  Harrow                337 non-null    object
 16  Havering              337 non-null    object
 17  Hillingdon            337 non-null    object
 18  Hounslow              337 non-null    object
 19  Islington             337 non-null    object
 20  Kensington & Chelsea  337 non-null    object
 21  Kingston upon Thames  337 non-null    object
 22  Lambeth               337 non-null    object
 23  Lewisham              337 non-null    object
 24  Merton                337 non-null    object
 25  Newham                337 non-null    object
 26  Redbridge             337 non-null    object
 27  Richmond upon Thames  337 non-null    object
 28  Southwark             337 non-null    object
 29  Sutton                337 non-null    object
 30  Tower Hamlets         337 non-null    object
 31  Waltham Forest        337 non-null    object
 32  Wandsworth            337 non-null    object
 33  Westminster           337 non-null    object
 34  Unnamed: 34           0 non-null      float64
 35  Inner London          337 non-null    object
 36  Outer London          337 non-null    object
 37  Unnamed: 37           0 non-null      float64
 38  NORTH EAST            337 non-null    object
 39  NORTH WEST            337 non-null    object
 40  YORKS & THE HUMBER    337 non-null    object
 41  EAST MIDLANDS         337 non-null    object
 42  WEST MIDLANDS         337 non-null    object
 43  EAST OF ENGLAND       337 non-null    object
 44  LONDON                337 non-null    object
 45  SOUTH EAST            337 non-null    object
 46  SOUTH WEST            337 non-null    object
 47  Unnamed: 47           0 non-null      float64
 48  England               337 non-null    object
dtypes: datetime64[ns](1), float64(3), object(45)
memory usage: 129.1+ KB

In [20]:
df_index_price = pd.read_excel('https://data.london.gov.uk/download/uk-house-price-index/70ac0766-8902-4eb5-aab5-01951aaed773/UK%20House%20price%20index.xls', sheet_name='Index Price', index_col= None)

In [21]:
df_index_price.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 337 entries, 0 to 336
Data columns (total 49 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Unnamed: 0            336 non-null    datetime64[ns]
 1   City of London        337 non-null    object
 2   Barking & Dagenham    337 non-null    object
 3   Barnet                337 non-null    object
 4   Bexley                337 non-null    object
 5   Brent                 337 non-null    object
 6   Bromley               337 non-null    object
 7   Camden                337 non-null    object
 8   Croydon               337 non-null    object
 9   Ealing                337 non-null    object
 10  Enfield               337 non-null    object
 11  Greenwich             337 non-null    object
 12  Hackney               337 non-null    object
 13  Hammersmith & Fulham  337 non-null    object
 14  Haringey              337 non-null    object
 15  Harrow                337 non-null    object
 16  Havering              337 non-null    object
 17  Hillingdon            337 non-null    object
 18  Hounslow              337 non-null    object
 19  Islington             337 non-null    object
 20  Kensington & Chelsea  337 non-null    object
 21  Kingston upon Thames  337 non-null    object
 22  Lambeth               337 non-null    object
 23  Lewisham              337 non-null    object
 24  Merton                337 non-null    object
 25  Newham                337 non-null    object
 26  Redbridge             337 non-null    object
 27  Richmond upon Thames  337 non-null    object
 28  Southwark             337 non-null    object
 29  Sutton                337 non-null    object
 30  Tower Hamlets         337 non-null    object
 31  Waltham Forest        337 non-null    object
 32  Wandsworth            337 non-null    object
 33  Westminster           337 non-null    object
 34  Unnamed: 34           0 non-null      float64
 35  Inner London          337 non-null    object
 36  Outer London          337 non-null    object
 37  Unnamed: 37           0 non-null      float64
 38  NORTH EAST            337 non-null    object
 39  NORTH WEST            337 non-null    object
 40  YORKS & THE HUMBER    337 non-null    object
 41  EAST MIDLANDS         337 non-null    object
 42  WEST MIDLANDS         337 non-null    object
 43  EAST OF ENGLAND       337 non-null    object
 44  LONDON                337 non-null    object
 45  SOUTH EAST            337 non-null    object
 46  SOUTH WEST            337 non-null    object
 47  Unnamed: 47           0 non-null      float64
 48  England               337 non-null    object
dtypes: datetime64[ns](1), float64(3), object(45)
memory usage: 129.1+ KB

In [22]:
df_index_price

,Unnamed: 0,City of London,Barking & Dagenham,Barnet,Bexley,Brent,Bromley,Camden,Croydon,Ealing,...,NORTH WEST,YORKS & THE HUMBER,EAST MIDLANDS,WEST MIDLANDS,EAST OF ENGLAND,LONDON,SOUTH EAST,SOUTH WEST,Unnamed: 47,England
0,NaT,E09000001,E09000002,E09000003,E09000004,E09000005,E09000006,E09000007,E09000008,E09000009,...,E12000002,E12000003,E12000004,E12000005,E12000006,E12000007,E12000008,E12000009,NaN,E92000001
1,1995-01-01,11.669374,22.929155,20.218477,24.816722,16.859574,21.904319,15.711197,23.945162,19.371754,...,32.312673,32.902881,29.638077,30.581484,24.839034,18.477406,24.171909,25.697918,NaN,26.226925
2,1995-02-01,10.489509,23.213407,20.198028,24.75171,17.028792,21.900587,15.526192,23.873468,19.616957,...,32.288374,32.701203,29.968038,31.09431,24.791722,18.06588,24.057181,25.53397,NaN,26.174367
3,1995-03-01,10.09622,23.296649,19.993719,24.591089,17.027255,21.844735,15.626663,23.790837,19.734032,...,32.662853,33.194459,29.533502,31.15789,24.606678,18.343629,24.207677,25.170817,NaN,26.226192
4,1995-04-01,9.838522,24.143895,19.671936,24.556773,17.25184,21.757596,15.602718,23.755384,19.930219,...,32.540031,33.498403,30.015321,31.166557,24.780465,18.482254,24.400095,25.735903,NaN,26.418235
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
332,2022-08-01,105.656778,159.148969,130.462619,153.835939,132.974467,137.720556,112.758599,147.533774,130.272211,...,159.012178,154.32148,162.906889,158.761363,156.956941,135.437901,150.611387,156.952194,NaN,153.525479
333,2022-09-01,105.585916,158.882915,131.219589,154.141978,138.299054,138.247239,111.46275,149.854291,130.979086,...,160.581875,155.833508,164.153484,160.313329,158.360732,135.536459,152.013503,157.716767,NaN,154.732941
334,2022-10-01,111.118669,161.444266,129.56221,156.530174,136.663626,140.263355,109.337314,150.346196,131.38716,...,161.72086,156.311794,164.433317,161.613768,158.717415,134.039587,152.339754,158.535892,NaN,155.140759
335,2022-11-01,120.979193,163.354786,127.436074,156.792996,135.304499,140.486192,108.891241,149.649804,131.817686,...,162.768585,156.709338,165.910468,161.416169,160.669898,134.76831,152.030562,158.18857,NaN,155.625884
336,2022-12-01,123.529612,164.517583,129.065653,158.952364,134.011773,140.3666,109.411492,148.970714,132.894303,...,162.525034,157.725614,166.695206,161.458164,159.359102,134.815019,152.625922,155.300878,NaN,155.341529

In [24]:
df_index_salesvol = pd.read_excel('https://data.london.gov.uk/download/uk-house-price-index/70ac0766-8902-4eb5-aab5-01951aaed773/UK%20House%20price%20index.xls', sheet_name='Sales Volume', index_col= None)

In [25]:
df_index_salesvol

,Unnamed: 0,City of London,Barking & Dagenham,Barnet,Bexley,Brent,Bromley,Camden,Croydon,Ealing,...,NORTH WEST,YORKS & THE HUMBER,EAST MIDLANDS,WEST MIDLANDS,EAST OF ENGLAND,LONDON,SOUTH EAST,SOUTH WEST,Unnamed: 47,England
0,NaT,E09000001,E09000002,E09000003,E09000004,E09000005,E09000006,E09000007,E09000008,E09000009,...,E12000002,E12000003,E12000004,E12000005,E12000006,E12000007,E12000008,E12000009,NaN,E92000001
1,1995-01-01,17,96,332,269,233,323,198,375,303,...,5801,4489,3990,4199,5812,7506,8809,5050,NaN,47639
2,1995-02-01,7,95,327,207,220,326,194,342,242,...,6129,4349,4211,4633,5928,6873,8658,5113,NaN,47880
3,1995-03-01,14,144,384,318,320,449,207,447,377,...,8375,6149,5840,6262,8374,9639,12177,7157,NaN,67025
4,1995-04-01,7,109,304,253,249,362,174,377,270,...,6714,5338,4892,5218,7004,8053,10941,6359,NaN,56925
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
330,2022-06-01,7,88,300,189,160,330,150,288,208,...,7330,5591,4963,5070,6395,6359,9457,6071,NaN,53824
331,2022-07-01,13,121,295,245,167,393,147,358,244,...,8166,6096,5499,5827,7028,7324,10544,6841,NaN,60366
332,2022-08-01,14,108,274,257,170,397,156,333,242,...,8146,6045,5379,5831,7521,7327,11392,6950,NaN,61845
333,2022-09-01,17,101,286,232,150,416,211,357,253,...,7683,5748,5194,5545,7016,7193,10654,6749,NaN,58713
334,2022-10-01,9,88,239,232,116,346,119,302,190,...,7081,5139,4573,4914,6168,6169,9606,6091,NaN,52334

### 2. Cleaning, transforming, and visualizing
This second stage is arguably the most important part of any Data Science project. The first thing to do is take a proper look at the data. Cleaning forms the majority of this stage, and can be done both before or after Transformation.

The end goal of data cleaning is to have tidy data. When data is tidy: 

1. Each variable has a column.
2. Each observation forms a row.

Keep the end goal in mind as you move through this process, every step will take you closer. 



***Hint:*** This part of the data science pipeline should test those skills you acquired in: 
- Intermediate Python for data science, all modules.
- pandas Foundations, all modules. 
- Manipulating DataFrames with pandas, all modules.
- Data Types for Data Science, Module Four.
- Python Data Science Toolbox - Part One, all modules

**2.1. Exploring your data** 

Think about your pandas functions for checking out a dataframe.

**2.2. Cleaning the data**

You might find you need to transpose your dataframe, check out what its row indexes are, and reset the index. You  also might find you need to assign the values of the first row to your column headings  . (Hint: recall the .columns feature of DataFrames, as well as the iloc[] method).

Don't be afraid to use StackOverflow for help  with this.

**2.3. Cleaning the data (part 2)**

You might we have to **rename** a couple columns. How do you do this? The clue's pretty bold...

**2.4.Transforming the data**

Remember what Wes McKinney said about tidy data? 

You might need to **melt** your DataFrame here.

Remember to make sure your column data types are all correct. Average prices, for example, should be floating point numbers...

**2.5. Cleaning the data (part 3)**

Do we have an equal number of observations in the ID, Average Price, Month, and London Borough columns? Remember that there are only 32 London Boroughs. How many entries do you have in that column? 

Check out the contents of the London Borough column, and if you find null values, get rid of them however you see fit.

**2.6. Visualizing the data**

To visualize the data, why not subset on a particular London Borough? Maybe do a line plot of Month against Average Price?

To limit the number of data points you have, you might want to extract the year from every month value your *Month* column. 

To this end, you *could* apply a ***lambda function***. Your logic could work as follows:
1. look through the `Month` column
2. extract the year from each individual value in that column 
3. store that corresponding year as separate column. 

Whether you go ahead with this is up to you. Just so long as you answer our initial brief: which boroughs of London have seen the greatest house price increase, on average, over the past two decades?

**3. Modeling**

Consider creating a function that will calculate a ratio of house prices, comparing the price of a house in 2018 to the price in 1998.

Consider calling this function create_price_ratio.

You'd want this function to:
1. Take a filter of dfg, specifically where this filter constrains the London_Borough, as an argument. For example, one admissible argument should be: dfg[dfg['London_Borough']=='Camden'].
2. Get the Average Price for that Borough, for the years 1998 and 2018.
4. Calculate the ratio of the Average Price for 1998 divided by the Average Price for 2018.
5. Return that ratio.

Once you've written this function, you ultimately want to use it to iterate through all the unique London_Boroughs and work out the ratio capturing the difference of house prices between 1998 and 2018.

Bear in mind: you don't have to write a function like this if you don't want to. If you can solve the brief otherwise, then great! 

***Hint***: This section should test the skills you acquired in:
- Python Data Science Toolbox - Part One, all modules

### 4. Conclusion
What can you conclude? Type out your conclusion below. 

Look back at your notebook. Think about how you might summarize what you have done, and prepare a quick presentation on it to your mentor at your next meeting. 

We hope you enjoyed this practical project. It should have consolidated your data hygiene and pandas skills by looking at a real-world problem involving just the kind of dataset you might encounter as a budding data scientist. Congratulations, and looking forward to seeing you at the next step in the course!